{"name":"Atomic","mbid":"66083e09-9486-43f7-98c4-8253c9a5da58","url":"https://www.last.fm/music/Blondie/_/Atomic","duration":"275000","streamable":{"#text":"0","fulltrack":"0"},"listeners":"348991","playcount":"1709209","artist":{"name":"Blondie","mbid":"4d2956d1-a3f7-44bb-9a41-67563e1a0c94","url":"https://www.last.fm/music/Blondie"},"album":{"artist":"Blondie","title":"The Best of Blondie","mbid":"a75ada9c-0ca8-475e-82f2-255ec1704936","url":"https://www.last.fm/music/Blondie/The+Best+of+Blondie","image":[{"#text":"https://lastfm.freetls.fastly.net/i/u/34s/ee5b3f50b00a4678c6de7b908c505fb4.png","size":"small"},{"#text":"https://lastfm.freetls.fastly.net/i/u/64s/ee5b3f50b00a4678c6de7b908c505fb4.png","size":"medium"},{"#text":"https://lastfm.freetls.fastly.net/i/u/174s/ee5b3f50b00a4678c6de7b908c505fb4.png","size":"large"},{"#text":"https://lastfm.freetls.fastly.net/i/u/300x300/ee5b3f50b00a4678c6de7b908c505fb4.png","size":"extralarge"}],"@attr":{"position":"13"}},"toptags":{"tag":[{"name":"80s","url":"https://www.last.fm/tag/80s"},{"name":"new wave","url":"https://www.last.fm/tag/new+wave"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"wiki":{"published":"23 Jul 2008, 08:21","summary":"\"Atomic\" was the third single from the 1979 album Eat to the Beat by Blondie. It was written by Debbie Harry and Jimmy Destri and the track was produced by Mike Chapman.\n\nThe song was produced as a mixture of new wave and disco which had proved to be so successful in their #1 hit from earlier in 1979, Heart of Glass. The guitar riff is directly influenced by the one in the Neil Diamond song Girl, You'll Be a Woman Soon.\n\nThe 1980 single version of \"Atomic\" was in fact a remix. <a href=\"http://www.last.fm/music/Blondie/_/Atomic\">Read more on Last.fm</a>.","content":"\"Atomic\" was the third single from the 1979 album Eat to the Beat by Blondie. It was written by Debbie Harry and Jimmy Destri and the track was produced by Mike Chapman.\n\nThe song was produced as a mixture of new wave and disco which had proved to be so successful in their #1 hit from earlier in 1979, Heart of Glass. The guitar riff is directly influenced by the one in the Neil Diamond song Girl, You'll Be a Woman Soon.\n\nThe 1980 single version of \"Atomic\" was in fact a remix. The original 4:35 version as featured on Eat to the Beat and also on the first greatest hits album The Best of Blondie in 1981 opens with an intro inspired by nursery rhyme \"Three Blind Mice\" and includes an instrumental break with a bass guitar solo. The 7\" version mixed by Mike Chapman omits the \"Three Blind Mice\" intro and replaces the instrumental break with a repeat of the verse.\n\nThe song reached number 1 in the UK for two weeks in February 1980 and number 39 in the US. The B-side was \"Die Young, Stay Pretty\", also from the album Eat to the Beat, which was Blondie's first attempt at reggae, a style they would perform again in \"The Tide Is High\". The UK 12\" single contained a live version of Bowie's Heroes featuring Robert Fripp on guitar recorded at London's Hammersmith Odeon just a month before. The track was included on 1993's rarities compilation Blonde and Beyond.\n\n\"Atomic\" was remixed and re-released in September 1994, where it reached number one on the Billboard dance charts and reached number 19 in the UK. The 1994 remix was included on compilations The Platinum Collection, Beautiful - The Remix Album and Remixed Remade Remodeled - The Remix Project . The track was remixed again four years later for UK compilation Atomic - The Very Best of Blondie and the '98 Xenomania mix was later included on the first Queer as Folk soundtrack album. The song was also featured in the video game Grand Theft Auto: Vice City, and it regarnered the song brief, modern attention. It was covered by Sleeper for the Trainspotting Soundtrack.\n\nIn 2005, Britain's Fashion Designer Store Debenhams, used the sountrack of Atomic for the backing of their \"Blue Cross Sale\" advert. <a href=\"http://www.last.fm/music/Blondie/_/Atomic\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}